Revit 2024 API
ParameterTypeId.RebarHookRotationAtStart Property
 "Hook Rotation At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarHookRotationAtStart { get; }
Visual Basic
Public Shared ReadOnly Property RebarHookRotationAtStart As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarHookRotationAtStart {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace